[{"title":"Change MySQL password for root","date":"2018-01-17T15:17:07.000Z","path":"2018/01/18/Change-MySQL-password-for-root/","text":"更换MySQL初始root密码前言 Mac下使用刚刚安装完的MySQL Workbench的时候会弹出如下对话框，要求填写root密码.. 可是密码在哪里？ 是我们在安装的时候弹出的一个对话框，提示我们记录root密码，但事实上都会被我们安装软件急切的心情所忽略。 因此，如何修改忘记的root密码呢？ 1. 停止MySQL Server服务 我们是可以在system preferences(在屏幕左上角小苹果里面的系统偏好设置)里面找到MySQL的状态 点击绿色running旁边的停止按钮，绿色会变成红色的stop。 2. 在Terminal(终端)中敲命令更改安全级别123$ cd /usr/local/mysql/bin$ sudo ./mysqld_safe --skip-grant-tables 输入电脑系统密码。 3. 新建Terminal窗口改root密码新建一个Terminal窗口，键入如下命令：123456789$ cd /usr/local/mysql/bin $ ./mysql -u root $mysql&gt; FLUSH PRIVILEGES;$mysql&gt; ALTER USER &apos;root&apos;@&apos;localhost&apos; IDENTIFIED by &apos;你的新密码&apos;; $mysql&gt; EXIT 4. 重启MySQL Server在System Preferences里面，MySQL状态还原成绿色的running 现在再打开Workbench输入新密码，现在就可以成功连接Server啦~ 参考：感谢Sean","tags":[{"name":"SQL","slug":"SQL","permalink":"http://aiaileen.github.io/tags/SQL/"},{"name":"Mac","slug":"Mac","permalink":"http://aiaileen.github.io/tags/Mac/"}]},{"title":"heading home","date":"2017-11-15T10:10:09.000Z","path":"2017/11/15/heading-home/","text":"回家第一学期结束了。现在在从墨尔本到重庆的飞机上。回家之前先去看望老哥和鱼先生。 窗外天空和积云的交接处映着日落，成了一条狭长的深橘红色。 我坐在过道旁，睡了一觉又一觉。10小时50分钟的航程真是难熬。天津航空还没有WiFi。按理讲长时间的国际航线应该有啊。。 于是我只得在飞机餐的间隙中看飞机上的视频，没一会就昏昏欲睡，睡一会就被飞机餐叫醒，吃东西或者喝饮料。周而复始。 不过好在航程现在已经过了大半，还剩三小时左右。很好捱过。 憧憬着下了飞机的日子。要见我的丑发了。要吃火锅了。要吃醉八仙了。要去KTV了。 美好的日子开始了。 不过这样的美好实在是短暂。大概我12月4号左右就不得不回墨尔本上NATTI了。虽然我并不想移民，但是玛麻说多条路为以后填一个选择。 打算回墨尔本之后就约consulting聊聊天，自己学一下PHP，看看能不能找个兼职干一干。 着眼现在吧。享受当下。凡事尽力，拼尽全力。 我也是可以的呀，毕竟昨天自己一个人给各种亲戚买保健品礼物，32度的天气跑了一天，装箱之后正正好好一个箱子23kg一个箱子22.7kg。然后今天又一个人拎了两个箱子坐tram然后倒机场大巴。哈哈😆 表白自己。","tags":[{"name":"Diary","slug":"Diary","permalink":"http://aiaileen.github.io/tags/Diary/"}]},{"title":"如何更改NTFS移动硬盘在MAC OS X下只读权限?","date":"2017-10-21T10:06:06.000Z","path":"2017/10/21/ReadOnlyHDD-mac/","text":"前言移动硬盘在以前的Windows电脑可以正常使用，今天连在mac上，发现只能读，不能写。 谷歌了一圈，大多都推荐使用软件blabla。。不过找到了个英文网站提供的方法，搬运过来。既然不安装软件就可以改权限，为什么还要占空间安多余的软件嘞~ 具体做法：1. 在Terminal（终端）中敲入如下指令 然后键入密码，就进入一个空白的fstab文件啦。 1$ sudo nano /etc/fstab 2. 在文件里敲入如下命令： 注意：这里NAME换成你的移动硬盘的名字，但是，如果有空格，要把空格换成\\040（如下图）硬盘名称原来是Seagate Backup Plus Drive 1LABEL=NAME none ntfs rw,auto,nobrowse 3. 编辑好后按^O(Ctr+O)保存，然后^X退出。 然后发现硬盘不见了，不在桌面上了。。 它在/Volumes文件夹下 4. 在Finder里按下command + shift + g，在弹出的对话框里敲入 硬盘文件夹就在这个Volumes文件夹下 5. 这时打开就可以更改删除文件啦~ 记得用后弹出再拔呀~ 参考:http://macdrug.com/write-ntfs-drive-macos-sierra/","tags":[{"name":"Mac","slug":"Mac","permalink":"http://aiaileen.github.io/tags/Mac/"}]},{"title":"这辈子","date":"2017-09-03T05:28:21.000Z","path":"2017/09/03/这辈子/","text":"这是很丧的一篇。。😑😑最近真的过得太痛苦了。每天都在挣扎着。学习上一点也不上进，觉得自己太差劲了，做什么都做不好。deadline越临近越焦虑，越觉得自己太差，于是越做不下去。。。越来越瞧不起自己了。反思自己为什么会来澳洲，花着高昂的学费，却一点成就都没有。不如及时止损回家，但是想到回家就更不能了。面子问题。前几天和老爸视频，开玩笑地说想回家不想念了。他说咋的压力大啊，你不能放弃啊，这不是半途而废么。。于是我就赶紧说没什么你不是说我不想你们也不总跟你们视频，要不我不念了回家陪你们啊。。我爸就说，可别，都知道你出国了 回来咋整。可是我真的很不开心。在来墨尔本的飞机上我就后悔了。我是从南京经停，厦门转机，然后直飞墨尔本的。当时天气不好全国都在下雨，每一段航程都延误。在南京经停和厦门候机的时候都很好，爸爸送完我就去和哥们喝酒了，妈妈一个人在家收拾，我和妈妈打电话视频的时候还说,这和你去上大学也没什么不一样哈，平时打打电话视频什么的，每年寒暑假回来两次啥的，全程乐呵呵闲扯家长里短。可是在我快要上飞机的时候，我爸喝多了，借着酒劲打电话，他跟我哭着说，老爸求你了，你下飞机就跟我们视频，每天定个时间跟老爸视频，老爸想你啊。。我一下子就崩了。。一开始觉得不耐烦不能理解，可是他说着说着我也越来越伤感，决堤。我还在开玩笑辩解这和我去南方工作读研有什么区别，他说不一样太不一样了，我想去看你直接买机票就能去，现在不行啊，还得办签证。。于是那整个在天上的夜晚，我都一直在哭，没有停过。身旁的两个老夫妇更是让我不知所措，他们应该是来探亲的吧。。快降落墨尔本Tullamarine机场的时候，那位妈妈十分紧张激动，男人没有说话，只是用力地握住她的手，望向她给予她力量。于是我更加想念我的爸妈了。不希望他们以后落得这个下场。更加不知道来澳洲这两年到底是为了什么。如果我在这里不开心，爸妈姥姥在家里牵挂我想念我也不开心，那么为什么要在这里花着大价钱度过两年的痛苦的时光。可是我不能回去了。我没有给自己留后路。回家能干什么呢？待业。只能待业。那么我爸妈根本就没法抬起头来了。然而我是一个胆小鬼。懦弱、逃避。我想放弃。最容易想到的便是杀掉自己。看到一篇文章说想知道你活着的意义，便在一张纸上写下你的想法，直到内心波澜起伏哭了出来，那么这便是你活着的意义。可是我全程冷漠没有哭，只有心痛。以下是我的心路历程 你这一辈子活着是为了什么 改变世界，推进人类发展 赚很多钱 旅行，环游世界 吃很多好吃的东西 和家人一起享受家庭的快乐，让爸妈姥姥享受天伦之乐 真的希望姥姥能每天都快乐 赚很多钱 幸福？ 不知道为什么活着，为了面子？还是为了爸妈？爱我的人不让他们失望？ 想过轻松的生活 想有品质的生活 因为爸妈在，所以还活着 拿高工资，买想买的东西，有足够的钱之后开一个小店，不需要做大，维持生计就行，然后就悠闲地度过一生 就想这么平淡地过一生然后死去 不明白。不管做了什么都免不了一死，那还有什么用，不如直接去死好了。生儿育女？有什么用。 真的很喜欢吃东西。因为吃这件事情很容易？ 总归都要死的，那在存活的日子里总要留下些什么？ 简单 活一辈子要不枉为人 让爸妈快乐 享受生活的快乐，快乐？ 赚很多钱 我想赚很多钱，想买什么就买什么，想去哪玩就去哪玩，自己当老板，想休假随时关了店门去旅行。 工作很闲，有钱拿，还可以做自己想做的事情，比如学乐器、钢琴，练写字…看书，写字，写散文随笔，去有花的地方，去充满阳光的地方，有个房间，有个阳台，我可以做家务、种菜、做菜，喝茶，看书，写字。 可这些都是虚妄。 活着为了什么？这辈子，为了什么活着？都说要有匠人精神，做一件事要做专，投入十几年二十几年的精神去做一件事。那么首先要找到这个东西。 做自己。可是我很懒很自卑 第二天，第二次尝试寻找–你这辈子活着是为了什么？ 赚很多钱，买我想买的东西，吃我想吃的东西 如果有什么事情，做到了之后，死掉了也没有遗憾，那我想大概是大四上学期那段日子了，虽然当时觉得每天过得很空虚，无所事事，经常吵架，但是真没要什么都有，想去看电影，说去就去了，想吃什么就去了，想赖床便也就赖了。最主要的是心情不好的时候，发哥会买好吃的哄我，一言不合就肉蟹煲，各种外卖。 回忆以前有什么用？！因为美好，所以只能是回忆。那么这辈子活着是为了什么？为了快乐？ 可是我现在并不快乐，但依然活着。不死是因为姥姥在。我一直希望她能过得更好。 活着就是活着。先存在，才有意义。 在没有找到意义之前，我们也一直存在。所以活着不一定要有意义，活着就是活着，不需要意义。 地球那么大么？ 不大。银河系更小。那么相对地来说，人类微不足道，更别提我本人了。 做什么事情会让你快乐？而且这种快乐在多年之后想起来还是会心满意足地笑？ 我想去体验生活 aileen，希望你能快乐 希望你每天都快乐 活着。 如果今天是你人生的最后一天，过了今天就死掉。你会怎么做？ 我会立马买一张机票奔回姥姥家，躺在她身边，和她闲扯，在她怀里心满意足地死掉。","tags":[{"name":"Diary","slug":"Diary","permalink":"http://aiaileen.github.io/tags/Diary/"}]},{"title":"FridayNight","date":"2017-08-04T10:16:10.000Z","path":"2017/08/04/FridayNight/","text":"First friday night drink in Melbourne…此刻室友们在客厅组了个麻将局，看视频喝饮料打麻将。。好不惬意。而我总是觉得有太多的事情要做，怎么也做不完。效率低下占一部分原因，基础薄弱也是我要弥补的地方。我在来墨尔本之前在知乎上看了好久，纠结了好久。众说纷纭。但是其实墨大的课程设置并没有多水。本来这一学期的课可以免掉，换成更高级的课，可是毕竟我的英语还是很弱，于是就读了这一学期的基础课。事实证明，我的英语真的很弱啊哈哈哈日常生活没有任何问题，但是看英文书啊。。还是会犯困串行，做不到可以像中文书那样浏览。區待提高。","tags":[{"name":"Diary","slug":"Diary","permalink":"http://aiaileen.github.io/tags/Diary/"}]},{"title":"First Class in UniMelb","date":"2017-07-24T11:47:09.000Z","path":"2017/07/24/First-Class-in-UniMelb/","text":"开学第一天。今天只有一节数据库，一节三小时的数据库。 Dr.Greg用其中的一个小时介绍自己授课团队和课程结构，剩余的时间介绍了一下数据库的基础。😂😂😂 这门课的前半学期总共分成Data Modelling和SQL两个大部分，分别以两个assignment来考核。也就是说，现在已经把作业的大概题目和due day给出，让你自由地安排时间来组队完成。上课体验很好，但是感觉英文还是不够过硬，老师讲的能听懂，但是有些同学的口音吧。。就不太能听懂提的问题了。。。 明天只有一节算法。明天有大块的时间可以自习啦~ 早起去游泳耶！ 不要受室友的影响！保证自己的作息！ 又早睡失败了😰","tags":[{"name":"Diary","slug":"Diary","permalink":"http://aiaileen.github.io/tags/Diary/"}]},{"title":"搬新家","date":"2017-07-23T15:04:40.000Z","path":"2017/07/24/NewHome/","text":"折腾了一整天，终于搬完了。 从3号来到猫本，已有半月有余，积攒的物件也不少。来来回回搬了三趟，然而还是把冰箱里的菜给忘了。。明天再去一趟。。于是我就住进了这个高大上的vision公寓。景色很好，尤其是晚上灯火闪烁，尽收眼底。刚刚用手机拍了一张，还可以。今天又早睡失败。。明天还要早起去享受高大上公寓的泳池和健身房哈哈哈哈不过明天一整天都要外食了。心疼钱包。。。奈何维妈每逢周一休息呢 开学啦，加油吧！Go Fighting!","tags":[{"name":"Diary","slug":"Diary","permalink":"http://aiaileen.github.io/tags/Diary/"}]}]